public class lv3 {
    public static void main(String[] args) {
        /* [需要的知识点：数组的合并以及排序算法]
        哲哲姐姐和天齐姐姐最近要给她们班级里的同学买秋天的第一杯奶茶，她们昨天在奶茶店订了奶茶并且
        带回了订单，每一张订单都有订单号和奶茶价格两个内容，但是两位姐姐是一起购买奶茶的，所以奶茶
        的订单号是交织在一起的。两位姐姐不想自己去领奶茶，就委托工具人老张煜去奶茶店帮忙取，你能写
        一个程序帮老张煜排序一下这些姐姐们的订单吗？
        哲哲姐姐的奶茶订单如下(第一个数字表示订单号，第二个数字表示奶茶价格)
        {{24, 8}, {35, 9}, {15, 10}, {17, 8}, {20, 7}, {49, 14}, {50, 16}, {98, 16}}
        天齐姐姐的奶茶订单如下
         {{3, 8}, {5, 9}, {2, 17}, {45, 8}, {13, 7}, {99, 14}, {175, 16}, {151, 99999}}
        请你通过代码将两组奶茶订单合并并且按照订单号的大小进行排序，帮助老张更好的去奶茶店取奶茶
        吧。
        3,8
        5,9
        ...

         数组1（zz）
         数组2（tq）
         合并数组
         for循环
         排序
         打印
         */
       /* int zz [][] ={{24, 8},{35, 9}, {15, 10}, {17, 8}, {20, 7}, {49, 14}, {50, 16}, {98, 16}};
        int tq[][]={{3, 8}, {5, 9}, {2, 17}, {45, 8}, {13, 7}, {99, 14}, {175, 16}, {151, 99999}};
        int tea[]=new int[zz.length+tq.length];
        int colLen = zz[0].length+tq[0].length;
        

        for(int i=1;i<tea.length;i++) {

            for(int j=0;j++)
                if (i < zz.length) {
                    tea[i][j] = zz[i][j];
                } else
            }
        }

    }
}*/

                int [][]num1={{24,8},{35,9},{15,10},{17,8},{20,7},{49,14},{50,16},{98,16}};
                int [][]num2={{3,8},{5,9},{2,17},{45,8},{13,7},{99,14},{175,16},{151,9999}};
                int [][]plus={{0,0},{0,0},{0,0},{0,0},{0,0},{0,0},{0,0},{0,0},{0,0},{0,0},{0,0},{0,0},{0,0},{0,0},{0,0},{0,0}};
                for(int a=0;a<num1.length;a++)
                    for(int b=0;b<2;b++)
                        plus[a][b]=num1[a][b];
                for(int c=0;c<num2.length;c++)
                    for(int d=0;d<2;d++)
                        plus[c+8][d]=num2[c][d];//将两个数组合并
                for(int i=0;i<plus.length;i++)
                    for(int j=0;j<15-i;j++)
                        if (plus[j][0] > plus[j + 1][0]) {
                            int temp = plus[j][0];
                            plus[j][0] = plus[j + 1][0];
                            plus[j + 1][0] = temp;//转移第一个数据
                            int temp1 = plus[j][1];
                            plus[j][1] = plus[j + 1][1];
                            plus[j + 1][1] = temp1;//转移第二个数据
                        }
                for(int m=0;m<plus.length;m++)
                    System.out.println(plus[m][0] + "," + plus[m][1]);//输出数组
            }
        }
